kenvinh/ch554_sdcc/examples/usb_device_hid/USB.c
	mDelaymS( 20 );																				//emulate the press down and pop up
	while(FLAG == 0);                                           								// Upload the key
	Enp1IntIn();						
	while(FLAG == 0);   																					
	mDelaymS( 20 );
	HIDKey[0] = 0X00;     						
	HIDKey[2] = 0X00;                                              								// Reset the key
	while(FLAG == 0);                                           						
	Enp1IntIn();			
	while(FLAG == 0); 
}


/*******************************************************************************
* Function Name  : extern HIDValueHandle( void )
* Description    : Upload the HID code
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/

char __code sPath[] = "`   E:\\vck1\\hid_recv.exe    \r   ";						    // The path for the software. SPACE for delay
char *pStr = sPath;

char __code s1Path[] = "`   \r  ";						
char *p1Str = s1Path;

void TSTKey(void)
{
	uint16_t KeyData;
	if(TKEY_CTRL&bTKC_IF)		                                  
	{
		KeyData = TKEY_DAT; 
		if (KeyData < (TouchKeyButton-100))	        //100 �����ȵ���	
		{
			TXflag =0x04 ;
		}
#ifdef DE_PRINTF
     printf("B.=  %04x\n",KeyData&0x7FFF);		
#endif		
	}
}

void TXflagHandle(uint8_t val)
{	
	TSTKey();
	if(TXflag & 0X01)
	{				
		SendKey(pStr);																	    // Upload path
		pStr++;	
		if(*pStr == '\0')
		{
			SendKey( "~" );																	// Upload ALT+B
			mDelaymS( 200 );	
			TXflag &= 0xFE;
		}	
	}	
	else if(TXflag & 0X02)
	{				
		SendKey(p1Str);																	    // Upload path
		pStr++;	
		if(*p1Str == '\0')
		{
			SendKey( "~" );																	// Upload ALT+B
			mDelaymS( 200 );	
			TXflag &= 0xFE;
		}
	}
	else if(TXflag & 0x04)	    					
	{
		char btn[3];
		btn[0]= val+ 0x30;
		//SendKey(btn);
		SendKey("` ");
		//TX[0] = val;	
		//Enp2TX();
		TXflag &= 0xFB;		
	}
	else if(TXflag & 0x08)	    					
	{
		SendKey("A");
		//TX[0] = val;	
		//Enp2TX();
		TXflag &= 0xFB;		
	}
}

/**************************** END *************************************/
